{
  "blogs": [
    {
      "title": "How blockchain can transform traceability in the automotive space",
      "body": "When big automakers first began investigating the potential use cases for blockchain in their industry, they quickly identified compliance as an area of promise. Because it’s immutable, blockchain can be a very powerful tool for tracing things, from the supply chain for an avocado to the ownership of a non-fungible token (NFT). Because it can be distributed among different participants and respect data confidentiality, it can act as a trust machine. Automakers quickly saw the potential to apply blockchain to their own supply chains so that they could more quickly determine where all of the components in each car came from.\n\nA typical car has several thousand parts, from windshields and cup holders to the screws that hold your car together. Automakers produce some, but not all, of these parts, and they typically work with hundreds of suppliers to produce the rest. In addition to the suppliers of components, there are members of the supply chain who produce raw materials as well.\n\nUsing blockchain to simplify automotive compliance\n\nAs early as end of 2018, the French automaker Renault has been working with IBM to create a blockchain-based solution to unite their suppliers on a single platform designed to certify the compliance of all vehicle components, from design to production. Last fall, a successful trial was conducted alongside several equipment manufacturers and at Renault’s Douai plant, where all participants were able to access and share compliance information with data available in near real time. Following the successful trial, XCEED (eXtended Compliance End-to-End Distributed) began onboarding new members, starting with three of Renault’s partner plants.\n\nDesigned to be an industry-wide solution that is also tailored to the regulatory requirements, especially in Europe for the first step, large automotive companies as well as smaller businesses and suppliers can benefit from compliance information sharing along with reduced costs and effort associated with audits. Rather than having to form a task force to collect and check the compliance history of a given part or series of parts, anyone in the supply chain can access it with a few simple clicks.\n\nAs more organizations join XCEED, companies can also begin to experiment with other ways of taking advantage of this information exchange. Recalls could be conducted on a more precise basis and much more swiftly, due to the increased visibility in the supply chain. Companies can also begin looking for ways to operationalize this data, using it to refine their sales or purchasing strategies. As software becomes an increasingly important component in cars, being able to trace parts and components will also be crucial for tracing software versions and ensuring compatibility with the rest of the vehicle.\n\nBlockchain is a proven tool for helping supply chain partners work together better. From food to pharmaceuticals, companies are continuing to invest in blockchain to make their supply chains more resilient, more automatable and more transparent. When supply chains are more efficient, they are also more sustainable. By enabling new ways for organizations to work with their suppliers and vice versa, compliance is only the beginning.",
      "author": "Allan",
      "id": 3
    },
    {
      "title": "What is Blockchain Mining?",
      "body": "Blockchain Mining is a process used to validate new transactions. Different Blockchain implementations use different methods for validation. In this blog, I will explain an example of Bitcoin Mining. When new Blockchain transaction happens, before adding these transactions to the Block, all the miners participating in mining are given a mathematical problem. This mathematical problem is a difficult problem based on the hash algorithm which is solvable only by Brute-force. \n\nThe only way to solve this problem is to check for each possible solution to see if it is right, no shortcuts work. Finding the solution doesn’t require intelligence, it just requires faster computational speed. The solution to the mathematical problem is called Proof-of-Work. The Proof-of-Work, as the name suggests is the proof that the miner has spent the time and resources to find the solution. As mentioned previously, Blockchain mining requires a lot of resources. And for spending the time and resources for this, the miner receives a reward called Mining reward.",
      "author": "Allan",
      "id": 4
    }
  ]
}